# AsDouble Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..AsDouble Method
IFCData Class See Also
---
Gets storage value as double when its PrimitiveType is double.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double AsDouble()
```

Visual Basic
---
```text
Public Function AsDouble As Double
```

Visual C++
---
```text
public:
double AsDouble()
```

# ### Return Value
The double value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The primitive type is not double. |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace